webmahasiswa/app/Controllers/Mahasiswa.php

SELECT *
FROM `mahasiswa`
---
    public function index()
    {
        $model = new MahasiswaModel();
        $data['mahasiswa'] = $model->findAll();

DELETE FROM `mahasiswa`
WHERE `nim` IN ('1234567')
---
    public function delete($nim)
    {
        $model = new MahasiswaModel();
        $model->delete($nim);